In [113]:
import pandas as pd

In [114]:
df = pd.read_csv("/content/train.csv")

In [115]:
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [116]:
df = df.drop(["Name","Ticket"],axis=1) #["Name","Ticket"]

In [117]:
df.isna().any()

PassengerId    False
Survived       False
Pclass         False
Sex            False
Age             True
SibSp          False
Parch          False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [118]:
mean_age = round(df["Age"].mean())

In [119]:
mean_age

30

In [120]:
df["Age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [121]:
df["Age"].fillna(mean_age,inplace=True) #inplace=True

In [122]:
df.isna().any()

PassengerId    False
Survived       False
Pclass         False
Sex            False
Age            False
SibSp          False
Parch          False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [123]:
df["Cabin"].fillna(-1,inplace=True)

In [124]:
df["Cabin"].astype("category")

0        -1
1       C85
2        -1
3      C123
4        -1
       ...
886      -1
887     B42
888      -1
889    C148
890      -1
Name: Cabin, Length: 891, dtype: category
Categories (148, object): [-1, A10, A14, A16, ..., F38, F4, G6, T]

In [125]:
df["Cabin"] = df["Cabin"].astype("category")

In [126]:
#df["Cabin"].cat.categories

In [127]:
df["Cabin"] = df["Cabin"].cat.codes

In [128]:
df[df["Cabin"]!=0]["Cabin"].mode()

0     48
1     64
2    146
dtype: int16

In [129]:
df["Cabin"].replace({0:48},inplace=True)

In [130]:
df

     PassengerId  Survived  Pclass     Sex  ...  Parch     Fare  Cabin  Embarked
0              1         0       3    male  ...      0   7.2500     48         S
1              2         1       1  female  ...      0  71.2833     82         C
2              3         1       3  female  ...      0   7.9250     48         S
3              4         1       1  female  ...      0  53.1000     56         S
4              5         0       3    male  ...      0   8.0500     48         S
..           ...       ...     ...     ...  ...    ...      ...    ...       ...
886          887         0       2    male  ...      0  13.0000     48         S
887          888         1       1  female  ...      0  30.0000     31         S
888          889         0       3  female  ...      2  23.4500     48         S
889          890         1       1    male  ...      0  30.0000     61         C
890          891         0       3    male  ...      0   7.7500     48         Q

[891 rows x 10 columns]

In [136]:
df["Embarked"].mode()[0]

'S'

In [143]:
df["Embarked"].fillna(df["Embarked"].mode()[0],inplace=True)

In [144]:
df.isna().any()

PassengerId    False
Survived       False
Pclass         False
Sex            False
Age            False
SibSp          False
Parch          False
Fare           False
Cabin          False
Embarked       False
dtype: bool

In [146]:
df["Embarked"] = df["Embarked"].astype("category")

In [149]:
df["Embarked"] = df["Embarked"].cat.codes

In [153]:
df["Sex"].replace({"male":0,"female" : 1},inplace=True)

In [156]:
df

     PassengerId  Survived  Pclass  Sex  ...  Parch     Fare  Cabin  Embarked
0              1         0       3    0  ...      0   7.2500     48         2
1              2         1       1    1  ...      0  71.2833     82         0
2              3         1       3    1  ...      0   7.9250     48         2
3              4         1       1    1  ...      0  53.1000     56         2
4              5         0       3    0  ...      0   8.0500     48         2
..           ...       ...     ...  ...  ...    ...      ...    ...       ...
886          887         0       2    0  ...      0  13.0000     48         2
887          888         1       1    1  ...      0  30.0000     31         2
888          889         0       3    1  ...      2  23.4500     48         2
889          890         1       1    0  ...      0  30.0000     61         0
890          891         0       3    0  ...      0   7.7500     48         1

[891 rows x 10 columns]

In [161]:
x = df.drop("Survived",axis=1)

In [162]:
y = df["Survived"]